# NotOneLoopPath3d Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..NotOneLoopPath3d Property
BuiltInFailures..::..SketchFailures Class See Also
---
More than one loop not allowed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotOneLoopPath3d { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotOneLoopPath3d As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotOneLoopPath3d {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace